<a href="https://colab.research.google.com/github/hannahmarcum19/MIS2800/blob/main/IC4.1_MARCUM.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# IMPORTANT â—
The below blocks are the lines of code to begin using sqlite3 magic.  

This is meant to be reused as needed.  To use, go to File > Save a Copy in Drive.

In [ ]:
!pip install --upgrade pandas ipython-sql prettytable==3.10.1

In [ ]:
# Install the SQL extension. Remember to type exactly as shown here.
!pip install ipython-sql
print("ipython sql installed")

In [ ]:
# Load the SQL magic extension
%load_ext sql

In [ ]:
#this code imports sqlite3 and prints a statement stating it has been imported
import sqlite3
print("sqlite3 imported")

In [ ]:
# This creates a brand-new, empty database file named [name of your database.db]
conn = sqlite3.connect('nameOfDatabase.db')
print("nameOfDatabase database created")

In [ ]:
# This line is required so Colab stops acting like Python and acts more like a SQL database terminal
%sql sqlite:///nameOfDatabase.db

# ----SPECIFIC FOR PREP/IC/HW ----

In [12]:
%%sql
CREATE TABLE IF NOT EXISTS products (
  product_id INTEGER PRIMARY KEY,
  name TEXT,
  price REAL
)
STRICT;

 * sqlite:///nameOfDatabase.db
Done.

[]

In [13]:
%%sql
INSERT INTO products (name, price) VALUES ('Superbowl Jersey', 120.00);
INSERT INTO products (name, price) VALUES ('Team Cap', 24.99);
INSERT INTO products (name, price) VALUES ('Hoodie', 59.50);
SELECT * FROM products ORDER BY product_id;

 * sqlite:///nameOfDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Superbowl Jersey', 120.0), (2, 'Team Cap', 24.99), (3, 'Hoodie', 59.5)]

In [14]:
%%sql
SELECT * FROM products
WHERE price > 50
ORDER BY price DESC;

 * sqlite:///nameOfDatabase.db
Done.

[(1, 'Superbowl Jersey', 120.0), (3, 'Hoodie', 59.5)]

In [15]:
%%sql
UPDATE products
SET price = 99.99
WHERE name = 'Superbowl Jersey';
SELECT * FROM products ORDER BY product_id;

 * sqlite:///nameOfDatabase.db
1 rows affected.
Done.

[(1, 'Superbowl Jersey', 99.99), (2, 'Team Cap', 24.99), (3, 'Hoodie', 59.5)]

In [17]:
%%sql
DELETE FROM products
WHERE product_id = 1;
SELECT * FROM products ORDER BY product_id

 * sqlite:///nameOfDatabase.db
0 rows affected.
Done.

[(2, 'Team Cap', 24.99), (3, 'Hoodie', 59.5)]